{
    "question": "Why sky is blue?",
    "context": "<P> the southern darkness, which is the Lake of Heaven.\nThe Universal Harmony records various wonders, and it says: \"When the P'eng journeys to the southern darkness, the waters are roiled for three thousand li. He beats the whirlwind and rises ninety thousand li, setting off on the sixth month gale.\" Wavering heat, bits of dust, living things blowing each other about – the sky looks very blue. Is that its real color, or is it because it is so far away and has no end? When the bird looks down, all he sees is blue too.\nIf water is not piled up deep <P> blue wavelengths dominate due to the Chappuis absorption caused by ozone. Even some websites dedicated to information about ozone still propagate the incorrect claim that ozone does not contribute to the blue color of the sky, though this effect is much weaker during the rest of the day, between morning and evening twilight.\nWhen the sky is clear, the blue hour can be a colorful spectacle, with the indirect sunlight tinting the sky yellow, orange, red, and blue. This effect is caused by the relative diffusibility of shorter wavelengths (bluer rays) of visible light versus the longer wavelengths (redder rays). During <P> colours, sky blue on dark blue on dark green, represent the three mediums of communication: air, sea and land. <P> direct path to the observer. The remaining unscattered light is therefore mostly of longer wavelengths and appears more red.\nSome of the scattering can also be from sulfate particles. For years after large Plinian eruptions, the blue cast of the sky is notably brightened by the persistent sulfate load of the stratospheric gases. Some works of the artist J. M. W. Turner may owe their vivid red colours to the eruption of Mount Tambora in his lifetime.\nIn locations with little light pollution, the moonlit night sky is also blue, because moonlight is reflected sunlight, with a slightly lower color temperature due <P> sunlight that casts shadows onto understory leaves and thereby limits plant photosynthesis to the top canopy layer, (see below). Color The Earth's atmosphere scatters short-wavelength light more efficiently than that of longer wavelengths. Because its wavelengths are shorter,  blue light is more strongly scattered than the longer-wavelength lights, red or green. Hence the result that when looking at the sky away from the direct incident sunlight, the human eye perceives the sky to be blue. The color perceived is similar to that presented by a monochromatic blue (at wavelength 474–476 nm) mixed with white light, that is, an unsaturated <P> pH. Purple mountains phenomenon It has been observed that the greater the distance between a viewers eyes and mountains, the lighter and more blue or purple they will appear. This phenomenon, long recognized by Leonardo da Vinci and other painters, is called aerial perspective or atmospheric perspective. The more distant the mountains are, the less contrast the eye sees between the mountains and the sky.\nThe bluish color is caused by an optical effect called Rayleigh scattering. The sunlit sky is blue because air scatters short-wavelength light more than longer wavelengths. Since blue light is at the short wavelength end of <P> wavelength light such as red, which is the reason why the sky appears blue from Earth. The ocean contributes to Earth's blueness, but to a lesser degree than scattering. Earth is a pale blue dot, rather than dark blue, because white light reflected by clouds combines with the scattered blue light.\nEarth's reflectance spectrum from the far-ultraviolet to the near-infrared is unlike any other observed planet's and is partially due to the presence of life on Earth. Rayleigh scattering, which causes Earth's blueness, is enhanced in an atmosphere that does not substantially absorb visible light, unlike, for example, the orange-brown color"
}